//** @file
//   Capability Type Name Sting for PCI Capability
//
//;******************************************************************************
//;* Copyright (c) 2022, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************


#include "Standard.uni"

#string STR_NULL_STRING                                                 #language en-US "NULL"
#string STR_UNDEFINED_STRING                                            #language en-US "Undefined"
//
// PCI Capability
//
#string STR_PCI_CAP00_STRING                                            #language en-US "Null Capability"
#string STR_PCI_CAP01_STRING                                            #language en-US "PCI Power Management Interface"
#string STR_PCI_CAP02_STRING                                            #language en-US "AGP"
#string STR_PCI_CAP03_STRING                                            #language en-US "VPD"
#string STR_PCI_CAP04_STRING                                            #language en-US "Slot Identification"
#string STR_PCI_CAP05_STRING                                            #language en-US "Message Signaled Interrupts"
#string STR_PCI_CAP06_STRING                                            #language en-US "CompactPCI Hot Swap"
#string STR_PCI_CAP07_STRING                                            #language en-US "PCI-X"
#string STR_PCI_CAP08_STRING                                            #language en-US "HyperTransport"
#string STR_PCI_CAP09_STRING                                            #language en-US "Vendor Specific"
#string STR_PCI_CAP0A_STRING                                            #language en-US "Debug port"
#string STR_PCI_CAP0B_STRING                                            #language en-US "CompactPCI central resource control"
#string STR_PCI_CAP0C_STRING                                            #language en-US "PCI Hot-Plug"
#string STR_PCI_CAP0D_STRING                                            #language en-US "PCI Bridge Subsystem Vendor ID"
#string STR_PCI_CAP0E_STRING                                            #language en-US "AGP 8x"
#string STR_PCI_CAP0F_STRING                                            #language en-US "Secure Device"
#string STR_PCI_CAP10_STRING                                            #language en-US "PCI Express"
#string STR_PCI_CAP11_STRING                                            #language en-US "MSI-X"
#string STR_PCI_CAP12_STRING                                            #language en-US "Serial ATA Data/Index Configuration"
#string STR_PCI_CAP13_STRING                                            #language en-US "Advanced Features (AF)"
#string STR_PCI_CAP14_STRING                                            #language en-US "Enhanced Allocation"
#string STR_PCI_CAP15_STRING                                            #language en-US "Flattening Portal Bridge"

//
// PCI Extended Capability
//

#string STR_PCIE_EXTCAP0000_STRING                                      #language en-US "Null Capability"
#string STR_PCIE_EXTCAP0001_STRING                                      #language en-US "Advanced Error Reporting (AER)"
#string STR_PCIE_EXTCAP0002_STRING                                      #language en-US "Virtual Channel (VC)"
#string STR_PCIE_EXTCAP0003_STRING                                      #language en-US "Device Serial Number"
#string STR_PCIE_EXTCAP0004_STRING                                      #language en-US "Power Budgeting"
#string STR_PCIE_EXTCAP0005_STRING                                      #language en-US "Root Complex Link Declaration"
#string STR_PCIE_EXTCAP0006_STRING                                      #language en-US "Root Complex Internal Link Control"
#string STR_PCIE_EXTCAP0007_STRING                                      #language en-US "Root Complex Event Collector Endpoint Association"
#string STR_PCIE_EXTCAP0008_STRING                                      #language en-US "Multi-Function Virtual Channel (MFVC)"
#string STR_PCIE_EXTCAP0009_STRING                                      #language en-US "Virtual Channel (VC)"
#string STR_PCIE_EXTCAP000A_STRING                                      #language en-US "Root Complex Register Block (RCRB) Header"
#string STR_PCIE_EXTCAP000B_STRING                                      #language en-US "Vendor-Specific Extended Capability (VSEC)"
#string STR_PCIE_EXTCAP000C_STRING                                      #language en-US "Configuration Access Correlation (CAC)"
#string STR_PCIE_EXTCAP000D_STRING                                      #language en-US "Access Control Services (ACS)"
#string STR_PCIE_EXTCAP000E_STRING                                      #language en-US "Alternative Routing-ID Interpretation (ARI)"
#string STR_PCIE_EXTCAP000F_STRING                                      #language en-US "Address Translation Services (ATS)"
#string STR_PCIE_EXTCAP0010_STRING                                      #language en-US "Single Root I/O Virtualization (SR-IOV)"
#string STR_PCIE_EXTCAP0011_STRING                                      #language en-US "Deprecated; formerly Multi-Root I/O Virtualization (MR-IOV)"
#string STR_PCIE_EXTCAP0012_STRING                                      #language en-US "Multicast"
#string STR_PCIE_EXTCAP0013_STRING                                      #language en-US "Page Request Interface (PRI)"
#string STR_PCIE_EXTCAP0014_STRING                                      #language en-US "Reserved for AMD"
#string STR_PCIE_EXTCAP0015_STRING                                      #language en-US "Resizable BAR"
#string STR_PCIE_EXTCAP0016_STRING                                      #language en-US "Dynamic Power Allocation (DPA)"
#string STR_PCIE_EXTCAP0017_STRING                                      #language en-US "TPH Requester"
#string STR_PCIE_EXTCAP0018_STRING                                      #language en-US "Latency Tolerance Reporting (LTR)"
#string STR_PCIE_EXTCAP0019_STRING                                      #language en-US "Secondary PCI Express"
#string STR_PCIE_EXTCAP001A_STRING                                      #language en-US "Protocol Multiplexing (PMUX)"
#string STR_PCIE_EXTCAP001B_STRING                                      #language en-US "Process Address Space ID (PASID)"
#string STR_PCIE_EXTCAP001C_STRING                                      #language en-US "LN Requester (LNR)"
#string STR_PCIE_EXTCAP001D_STRING                                      #language en-US "Downstream Port Containment (DPC)"
#string STR_PCIE_EXTCAP001E_STRING                                      #language en-US "L1 PM Substates"
#string STR_PCIE_EXTCAP001F_STRING                                      #language en-US "Precision Time Measurement (PTM)"
#string STR_PCIE_EXTCAP0020_STRING                                      #language en-US "PCI Express over M-PHY (M-PCIe)"
#string STR_PCIE_EXTCAP0021_STRING                                      #language en-US "FRS Queueing"
#string STR_PCIE_EXTCAP0022_STRING                                      #language en-US "Readiness Time Reporting"
#string STR_PCIE_EXTCAP0023_STRING                                      #language en-US "Designated Vendor-Specific Extended Capability"
#string STR_PCIE_EXTCAP0024_STRING                                      #language en-US "VF Resizable BAR"
#string STR_PCIE_EXTCAP0025_STRING                                      #language en-US "Data Link Feature"
#string STR_PCIE_EXTCAP0026_STRING                                      #language en-US "Physical Layer 16.0 GT/s"
#string STR_PCIE_EXTCAP0027_STRING                                      #language en-US "Lane Margining at the Receiver"
#string STR_PCIE_EXTCAP0028_STRING                                      #language en-US "Hierarchy ID"
#string STR_PCIE_EXTCAP0029_STRING                                      #language en-US "Native PCIe Enclosure Management (NPEM)"
#string STR_PCIE_EXTCAP002A_STRING                                      #language en-US "Physical Layer 32.0 GT/s"
#string STR_PCIE_EXTCAP002B_STRING                                      #language en-US "Alternate Protocol"
#string STR_PCIE_EXTCAP002C_STRING                                      #language en-US "System Firmware Intermediary (SFI)"
#string STR_PCIE_EXTCAP002D_STRING                                      #language en-US "Shadow Functions"
#string STR_PCIE_EXTCAP002E_STRING                                      #language en-US "Data Object Exchange"
#string STR_PCIE_EXTCAP002F_STRING                                      #language en-US "Device 3"
#string STR_PCIE_EXTCAP0030_STRING                                      #language en-US "Integrity and Data Encryption (IDE)"
#string STR_PCIE_EXTCAP0031_STRING                                      #language en-US "Physical Layer 64.0 GT/s Capability"
#string STR_PCIE_EXTCAP0032_STRING                                      #language en-US "Flit Logging"
#string STR_PCIE_EXTCAP0033_STRING                                      #language en-US "Flit Performance Measurement"
#string STR_PCIE_EXTCAP0034_STRING                                      #language en-US "Flit Error Injection"
